'''
4. Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y). При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **. Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
'''
def my_funk(x: float, y: int):

    a = 0
    n = 1
    a = x
    while n < abs(y):
        a *= x
        n += 1
    if y < 0:
        print(1 / a)
    else:
        print(a)
if __name__ == '__main__':
    my_funk(2, -2)